pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_next_intruction_is_reachable.h
//---------------------------------------------------------------------------*
//                                                                           *
//         File 'pic18_intermediate_next_intruction_is_reachable.h'          *
//                        Generated by version 2.4.3                         *
//                       june 17th, 2013, at 15h21'6"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_intermediate_next_intruction_is_reachable_ENTITIES_DEFINED
#define pic18_intermediate_next_intruction_is_reachable_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "pic18_intermediate_classes.h"
#include "pic18_mnemonics.h"
#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "intermediate_generic.h"
#include "piccoloDevice_semantics.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*
//                                                                           *
//Category reader '@pic18_intermediate_instruction nextInstructionIsReachable'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef GALGAS_bool (*categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                      C_Compiler * inCompiler
                                                                                                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryReader_nextInstructionIsReachable (const PMSInt32 inClassIndex,
                                                     categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_nextInstructionIsReachable inReader) ;

//---------------------------------------------------------------------------*

GALGAS_bool callCategoryReader_nextInstructionIsReachable (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                           C_Compiler * inCompiler
                                                           COMMA_LOCATION_ARGS) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
